# 1. Каждое из слов «разработка», «сокет», «декоратор» представить в строковом формате и проверить тип и содержание соответствующих переменных. Затем с помощью онлайн-конвертера преобразовать строковые представление в формат Unicode и также проверить тип и содержимое переменных.


# «разработка», «сокет», «декоратор» представить в строковом формате
str1 = 'разработка'
str2 = 'сокет'
str3 = 'декоратор'


# проверить тип и содержание соответствующих переменных
print(type(str1))   # <class 'str'>
print(str1)         # разработка

print(type(str2))   # <class 'str'>
print(str2)         # сокет

print(type(str3))   # <class 'str'>
print(str3)         # декоратор

      
# строки в формате Unicode
str1_u = '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430'
str2_u = '\u0441\u043e\u043a\u0435\u0442'
str3_u = '\u0434\u0435\u043a\u043e\u0440\u0430\u0442\u043e\u0440'

      
# проверить тип и содержание соответствующих переменных
print(type(str1))   # <class 'str'>
print(str1)         # разработка

print(type(str2))   # <class 'str'>
print(str2)         # сокет

print(type(str3))   # <class 'str'>
print(str3)         # декоратор
      